#! /usr/bin/python
# coding: utf-8
# Prerequisite: sudo easy_install regex
import regex
import sys
import collections
  
test = True

"""
Regex series:

Unhandled cases:
भेदन (भिद् ल्युट्)
"""

lines = []
if (test):
  test_lines = """
अ पु. संस्कृत वर्णमाला का प्रथम वर्ण [विशेषतया तीन दिन
तक चलने वाले सोम-याग (त्रिरात्र) के प्रथम दिन आज्य
स्तोत्र में ‘अगन् आयाहि वीतये’ ऋ.वे. 6.16.1० के आरम्भ
में उच्चरित किया जाता है (पश्चाद्वर्ती = बाद वाले दो दिन
में अर्थात् दूसरे एवं तीसरे दिन ‘क’ एवं ‘हो’ के साथ
उच्चारित होता है, ऋ.वे. 8.84.4 एवं ऋ.वे. 3.27.7) “एषा
उ वा प्रत्यक्षं वाग् यज्जिह्वाग्रेण एतद्वाचो वदति यद् ‘अ’
इति”, पञ्च. ब्रा. 2०.14.3।
अंश पु.1 अ. भाग (देवों, पितरों एवं मनुष्यों के लिए नियत)
ऋ.वे. 1०.31.3; अ.वे. 11.1.5;1 ब. पशु-भाग, बौ.श्रौ.सू.
2.11; 15 (दक्षिणा के रूप में देय) 2. सात आदित्यों में
एक का नाम, ऋ.वे. 2.27.1, अ.वे. 6.4.12; काठ.सं.
11.12; वा.सं. 34.54; उन देवताओं में सम्मिलित, जिन्हे
वाजपेय-याग में परवर्ती ‘पार्थ आहुतियां प्रदान की जाती
हैं, तै.सं. 1.8.13.3; काठ.सं. 15.7; 1०.5; श.ब्रा. 5.3.5.9;
49 सवन दिनों वाले अतिरात्र का अनुष्ठान करने वाला इस
देवता (अंश) के ऐश्वर्य को प्राप्त करता है, आप.श्रौ.सू.
23.7.5; हिरण्य.श्रौ.सू. 18.3.2; वह ‘अग्न्याधेय’ के समय
अगिन्मन्थन से सम्बद्ध है, मै.सं. 1.6.12; तै.ब्रा. 1.1.9.2;
अन्त्येष्टि के समय इसे एक घृताहुति प्रदान की जाती है,
वैखा.गृ.सू. 5.2.2; 3; 82 अक्षरों वाले एक वैदिक छन्द
का नाम, ऋ. प्रा. 17.4; निदा.सू. 1०5.2०।
""".split("\n")
  lines = test_lines
else:
  lines = sys.stdin.readlines()

full_text = "\n".join(lines)
full_text = regex.sub(r'^(\S+?)\s+(क्रि\.वि[ .])', '####\1####\1 \2', full_text, flags=regex.UNICODE)
full_text = regex.sub(r'^(\S+?)\s+(स्त्री[ .])', '####\1####\1 \2', full_text, flags=regex.UNICODE)
full_text = regex.sub(r'^([^ ]+) (पुं[ .])', '####\1####\1 \2', full_text, flags=regex.UNICODE)
full_text = regex.sub(r'^(\S+?)\s+(वि[ .])', '####\1####\1 \2', full_text, flags=regex.UNICODE)
full_text = regex.sub(r'^(\S+?)\s+(न[ .])', '####\1####\1 \2', full_text, flags=regex.UNICODE)
print(full_text)

